
# 整数
print('--------------整数----------------')
print(100)
print(-80)
print(0xff00)
print(0xa5b4c3d2)
print(10_000_000_000)

# 浮点数
print('--------------浮点----------------')
print(1.23)
print(3.14)
print(-1.23)
print(1.23e9)
print(1.2e-5)

# 字符串  转义符 \,  \n 换行、 \t 制表符
print('--------------字符串----------------')
print('I\'m "OK"!')
print('''line1
.... line2
.... line3
''')

print(r'''hello, \n
world''')

# 布尔
print('--------------布尔----------------')
print(True)
print(False)

# 空值
print('--------------空值----------------')
print(None)

# 变量
print('--------------变量----------------')
a = 1
t_007 = 'T007'

# 常量
print('--------------常量----------------')
PI = 3.14159265359

#